# FabricationRodsDisconnectedError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationRodsDisconnectedError Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
The hanger rod was disconnected because there is no structural component above.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationRodsDisconnectedError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationRodsDisconnectedError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationRodsDisconnectedError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace